// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:

// let array =[2,17,13,6,22,31,45,66,100,-18];
// // 1. перебрати його циклом while
// let i=0;
// while(i<=9){
//     console.log(array[i])
//     i++
// }
// // 2. перебрати його циклом for
// let array =[2,17,13,6,22,31,45,66,100,-18];
// for (let a = 0; a < array.length; a++) {
//     console.log(array[i]);
// }
// // 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let array =[2,17,13,6,22,31,45,66,100,-18];
// i = 0;
// while (b < array.length){
//     if (b%2 !== 0){
//         console.log(array[b]);
//     };
//     b++
// };
//
// // // 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let array =[2,17,13,6,22,31,45,66,100,-18];
// for (let c = 0; c < array.length; c++){
//     if (c%2 !== 0){
//         console.log(array[c]);
//     }
// };
//
// //  5. перебрати циклом while та вивести  числа тільки парні  значення
// let array =[2,17,13,6,22,31,45,66,100,-18];
// e = 0;
// while (e < array.length){
//     if (e%2 === 0){
//         console.log(array[e]);
//     };
//     e++
// };
//
 // 6. перебрати циклом for та вивести  числа тільки парні  значення
// let array =[2,17,13,6,22,31,45,66,100,-18];
// for (let r = 0; r < array.length; r++){
//     if (r%2 === 0){
//         console.log(array[r]);
//     }
// };

// 7. замінити кожне число кратне 3 на слово "okten"
// let array =[2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < array.length; i++){
//     if (array[i]%3 === 0){
//         array[i] = "okten";
//         console.log(array[i]);
//     }
// };
// console.log(array);

// 8. вивести масив в зворотньому порядку.
let array = [2,17,13,6,22,31,45,66,100,-18];
for (let i = array.length-1; i >= 0; i--){
    console.log(array[i]);
};